Revit 2027 API
Document.IsPainted Method
 Checks if the element's face is painted with a material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPainted(
	ElementId elementId,
	Face face
)
Public Function IsPainted (
	elementId As ElementId,
	face As Face
) As Boolean
public:
bool IsPainted(
	ElementId^ elementId,
	Face^ face
)
member IsPainted :
        elementId : ElementId *
        face : Face -> bool
Parameters
elementId ElementId
 The element that the face belongs to.
face Face
 The painted element's face.
Return Value
Boolean
 True if the element's face is painted.
Exceptions
Exception | Condition
ArgumentException |  The element elementId does not exist in the document -or- The face doesn't belong to the element
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace